SELECT
    Н_ОЦЕНКИ.ПРИМЕЧАНИЕ,
    Н_ВЕДОМОСТИ.ДАТА
FROM
    Н_ВЕДОМОСТИ
    JOIN Н_ОЦЕНКИ ON Н_ВЕДОМОСТИ.ОЦЕНКА = Н_ОЦЕНКИ.КОД
WHERE
    Н_ОЦЕНКИ.КОД = 'зачет'
    AND Н_ВЕДОМОСТИ.ИД < 39921;

SELECT
    Н_ЛЮДИ.ИД,
    Н_ОБУЧЕНИЯ.ЧЛВК_ИД,
    Н_УЧЕНИКИ.ГРУППА
FROM
    Н_ЛЮДИ
    RIGHT JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
    RIGHT JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ИД
WHERE
    Н_ЛЮДИ.ИМЯ = 'Александр'
    AND Н_ОБУЧЕНИЯ.ЧЛВК_ИД > 163276
    AND Н_УЧЕНИКИ.НАЧАЛО < '2009-02-09';

SELECT
    COUNT(*)
FROM
    Н_УЧЕНИКИ
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE
    Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ < (CURRENT_DATE - INTERVAL '25 years')
    AND Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ';

SELECT
    Н_ЛЮДИ.ФАМИЛИЯ,
    COUNT(*) AS КОЛИЧЕСТВО
FROM
    Н_ЛЮДИ
    JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
    JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
WHERE
    Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная'
GROUP BY
    Н_ЛЮДИ.ФАМИЛИЯ
HAVING
    COUNT(*) < 50;

SELECT
    Н_УЧЕНИКИ.ИД,
    CONCAT (
        Н_ЛЮДИ.ФАМИЛИЯ,
        ' ',
        Н_ЛЮДИ.ИМЯ,
        ' ',
        Н_ЛЮДИ.ОТЧЕСТВО
    ) AS Н_ФИО,
    AVG(
        CASE
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'зачет' THEN 5
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'незачет' THEN 2
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1', '2', '3', '4', '5') THEN CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER)
            ELSE NULL
        END
    ) AS Н_СР_ОЦЕНКА
FROM
    Н_УЧЕНИКИ
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE
    Н_УЧЕНИКИ.ГРУППА = '4100'
GROUP BY
    Н_УЧЕНИКИ.ИД,
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО
HAVING
    AVG(
        CASE
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'зачет' THEN 5
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'незачет' THEN 2
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1', '2', '3', '4', '5') THEN CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER)
            ELSE NULL
        END
    ) = (
        SELECT
            AVG(
                CASE
                    WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'зачет' THEN 5
                    WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'незачет' THEN 2
                    WHEN Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1', '2', '3', '4', '5') THEN CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER)
                    ELSE NULL
                END
            )
        FROM
            Н_УЧЕНИКИ
            JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
        WHERE
            Н_УЧЕНИКИ.ГРУППА = '1101'
    );

SELECT
    Н_УЧЕНИКИ.ГРУППА,
    CONCAT (
        Н_УЧЕНИКИ.ИД,
        ' ',
        Н_ЛЮДИ.ФАМИЛИЯ,
        ' ',
        Н_ЛЮДИ.ИМЯ,
        ' ',
        Н_ЛЮДИ.ОТЧЕСТВО
    ) AS Н_ФИО,
    CONCAT (Н_ПЛАНЫ.НОМЕР, ' ', Н_УЧЕНИКИ.СОСТОЯНИЕ) AS Н_ПРИКАЗ
FROM
    Н_УЧЕНИКИ
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
    JOIN Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ ON Н_ПЛАНЫ.НАПС_ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД
    JOIN Н_НАПР_СПЕЦ ON Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД = Н_НАПР_СПЕЦ.ИД
WHERE
    Н_УЧЕНИКИ.НАЧАЛО < '2012-09-01 00:00:00'
    AND Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Заочная' -- заочки нет
    AND Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ = '230101'
SELECT
    COUNT(*)
FROM
    Н_УЧЕНИКИ
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
    JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE
    Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ'
    AND Н_ВЕДОМОСТИ.ОЦЕНКА = '99'

--доп: фио учеников у которых было только 4 5 зачет
SELECT
    Н_УЧЕНИКИ.ИД,
    CONCAT (
        Н_ЛЮДИ.ФАМИЛИЯ,
        ' ',
        Н_ЛЮДИ.ИМЯ,
        ' ',
        Н_ЛЮДИ.ОТЧЕСТВО
    ) AS Н_ФИО
FROM
    Н_УЧЕНИКИ
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
GROUP BY
    Н_УЧЕНИКИ.ИД,
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО
HAVING
    COUNT(
        CASE
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА NOT IN ('4', '5', 'зачет') THEN 1
        END
    ) = 0
    AND COUNT(Н_ВЕДОМОСТИ.ОЦЕНКА) > 0;