SELECT
    Н_ОЦЕНКИ.ПРИМЕЧАНИЕ,
    Н_ВЕДОМОСТИ.ДАТА
FROM
    Н_ВЕДОМОСТИ
    JOIN Н_ОЦЕНКИ ON Н_ВЕДОМОСТИ.ОЦЕНКА = Н_ОЦЕНКИ.КОД
WHERE
    Н_ОЦЕНКИ.КОД = 'зачет'
    AND Н_ВЕДОМОСТИ.ИД < 39921;

SELECT
    Н_ЛЮДИ.ИД,
    Н_ОБУЧЕНИЯ.ЧЛВК_ИД,
    Н_УЧЕНИКИ.ГРУППА
FROM
    Н_ЛЮДИ
    RIGHT JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
    RIGHT JOIN Н_УЧЕНИКИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ИД
WHERE
    Н_ЛЮДИ.ИМЯ = 'Александр'
    AND Н_ОБУЧЕНИЯ.ЧЛВК_ИД > 163276
    AND Н_УЧЕНИКИ.НАЧАЛО < '2009-02-09';

SELECT
    COUNT(*)
FROM
    Н_УЧЕНИКИ
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE
    Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ < (CURRENT_DATE - INTERVAL '25 years')
    AND Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ';