--доп: фио учеников у которых было только 4 5 зачет
SELECT
    Н_УЧЕНИКИ.ИД,
    CONCAT (
        Н_ЛЮДИ.ФАМИЛИЯ,
        ' ',
        Н_ЛЮДИ.ИМЯ,
        ' ',
        Н_ЛЮДИ.ОТЧЕСТВО
    ) AS Н_ФИО
FROM
    Н_УЧЕНИКИ
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
GROUP BY
    Н_УЧЕНИКИ.ИД,
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО
HAVING
    COUNT(
        CASE
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА NOT IN ('4', '5', 'зачет') THEN 1
        END
    ) = 0
    AND COUNT(Н_ВЕДОМОСТИ.ОЦЕНКА) > 0;