SELECT
    Н_УЧЕНИКИ.ИД,
    CONCAT (
        Н_ЛЮДИ.ФАМИЛИЯ,
        ' ',
        Н_ЛЮДИ.ИМЯ,
        ' ',
        Н_ЛЮДИ.ОТЧЕСТВО
    ) AS Н_ФИО,
    AVG(
        CASE
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'зачет' THEN 5
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'незачет' THEN 2
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1', '2', '3', '4', '5') THEN CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER)
            ELSE NULL
        END
    ) AS Н_СР_ОЦЕНКА
FROM
    Н_УЧЕНИКИ
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE
    Н_УЧЕНИКИ.ГРУППА = '4100'
GROUP BY
    Н_УЧЕНИКИ.ИД,
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО
HAVING
    AVG(
        CASE
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'зачет' THEN 5
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'незачет' THEN 2
            WHEN Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1', '2', '3', '4', '5') THEN CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER)
            ELSE NULL
        END
    ) = (
        SELECT
            AVG(
                CASE
                    WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'зачет' THEN 5
                    WHEN Н_ВЕДОМОСТИ.ОЦЕНКА = 'незачет' THEN 2
                    WHEN Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1', '2', '3', '4', '5') THEN CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INTEGER)
                    ELSE NULL
                END
            )
        FROM
            Н_УЧЕНИКИ
            JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
        WHERE
            Н_УЧЕНИКИ.ГРУППА = '1101'
    );