SELECT
    Н_УЧЕНИКИ.ГРУППА,
    CONCAT (
        Н_УЧЕНИКИ.ИД,
        ' ',
        Н_ЛЮДИ.ФАМИЛИЯ,
        ' ',
        Н_ЛЮДИ.ИМЯ,
        ' ',
        Н_ЛЮДИ.ОТЧЕСТВО
    ) AS Н_ФИО,
    CONCAT (Н_ПЛАНЫ.НОМЕР, ' ', Н_УЧЕНИКИ.СОСТОЯНИЕ) AS Н_ПРИКАЗ
FROM
    Н_УЧЕНИКИ
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
    JOIN Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ ON Н_ПЛАНЫ.НАПС_ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД
    JOIN Н_НАПР_СПЕЦ ON Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД = Н_НАПР_СПЕЦ.ИД
WHERE
    Н_УЧЕНИКИ.НАЧАЛО < '2012-09-01 00:00:00'
    AND Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Заочная' -- заочки нет
    AND Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ = '230101'
SELECT
    COUNT(*)
FROM
    Н_УЧЕНИКИ
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
    JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE
    Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ'
    AND Н_ВЕДОМОСТИ.ОЦЕНКА = '99';